[{"title":"摘录《把时间当作朋友》的句子","date":"2017-03-31T01:53:07.000Z","path":"2017/03/31/摘录《把时间当作朋友》的句子/","text":"脚踏实地，不忘初心 #抱怨上司很愚蠢的人都只有一个共同的特征，它们只不过是在用“上司很愚蠢”作为自己偷懒的借口 #如果能平静的对待，那就专心的做自己的工作，完成自己的贡献，如果不能平静对待，不要抱怨， 应该选择安静的离开 #在一个团队中 二流人才是最容易产生流动愿望的 #兴趣，这些人并不是对正在做的事没有兴趣，而是没能力把目前正在做的事情做好。没有人喜欢自己做不好的事情， #兴趣，并不是很重要，只要一件事你能做好，而且做的比谁都好，你没办法对那件事情不感兴趣。 #往往不是有兴趣才能做好， 而是做好了才有兴趣。没兴趣，往往只不过是结果而已，却被当作不去做好的理由，最终，惩罚就是大量的时间白白流逝。 #人生苦短，如果成功太慢，那么幸福必然减半。 #方法固然重要，但是比起用功，几乎可以忽略不计。 #所有学习上的成功，都只靠两件事：策略和坚持，而坚持本身就是一就应该是最重要的策略。（坚持，就是时间的投入，大量时间的投入）。 #有些哪怕是常识的东西也需要亲身经历后才能体会。 #过去的事情是无法更改的，现在的烦恼是无济于事的。但是，将来的尴尬是可以避免的。 #大多时候，一个人的不现实就是因为她的想法不现实，而他的想法不现实，往往是因为他使用的句型无论怎么替换都会造出不现实的句子。（要是。。。。就好了！） 停，这个念头最耽误事了 2017.2.7#如果我们不去控制我们自己的大脑，甚至根本就没有意识到我们可以控制我们的大脑，我们就只能被我们的大脑控制。 #你的大脑并不是你，你的大脑属于“你的”大脑，你要明白你不应该隶属于你的大脑，而应该拥有你的大脑，并且你可以控制你的大脑。 #不再让自己成为自己大脑的奴隶，而是选择翻身做主人。 #痛苦就是这样，一旦我们竟然能运用心智把我们的注意力转移到其他地方的时候，痛苦几乎会消失，在你重新注意它之前，他几乎不会回来。 #当我们决心改变的时候，“懒惰”便指使我们的那个大脑的自我保护功能，“遗忘”–让我们不知不觉中停止改变 #你的电脑里出现了 一个极其耗费内存的，莫名其妙的线程，把cpu占用率提高到100%，于是你的电脑开始装“死”，或者真“死”，可惜，我们的大脑没有一个reset的按钮，我们的人生也没有Ghost恢复软件。 #走向成功的过程大抵上好像是你的起点在南极，而成功的终点在北极。那么无论你忘那个方向走，只要中途不改变 方向，最终都会到达北极，但是如果你中途改变了方向，甚至经常改变方向，你就几乎无法到达北极，甚至可能返回出发点。 2017.2.10#“观察”延伸了我们可以“体验”的范围，所以，我们常常可以从他人的经历中获得经验或者教训，进而增加我们自身的知识。然而，“体验”，“试错”和“观察”，都是存在局限的。于是，“阅读” 就成了获取知识的更加重要的手段，当然，也是相对更佳需要心智能力的手段。 2017.2.20#见识越少的人越喜欢用自己所有的见识作为判断依据，并且完全不顾自己见识的局限，其实也不知道自己见识的局限。 #用自己的学习结果去衡量老师往往并不准确，很多人都是在用自己的学习效果去衡量老师，以及讲课的学习方法和内容 2017.2.22#遗忘，是每一个人都有的自我保护功能。 #我们必须挣扎着整理已经输入大脑的信息，尽量让他们有序的排列起来，如果我们忘了记笔记，那些信息就会转化为无序的。 #自我奋斗，勤奋努力，都是天经地义的事，即便是有些人，貌似是不需要经过奋斗，甚至懒惰到令人嫉妒的 地步，也一样可以享受其他人即便奋斗，努力，甚至挣扎都不可能得到的一切，但是少数人的存在并不能说明问题。 #比较是相对的，相对的永远是没有尽头的。 #有一些人看透了着一切，可是却选择了逃避，这些人会认为“”万物皆空“，一切都是幻想而已，于是生成了可以跳出红尘，看破喧嚣，其实，这也只不过是心智力量太弱的表现而已。另外一些人也看透了这一切，却没有选择逃避，而是坦然的接受，他们运用自己的心智力量去分辨哪些快乐，或者幸福是建立在比较的基础之上的，而哪些快乐或者幸福是无需比较同样可以获得的。 #大量的时间被用来去追求必须通过比较才获得的欢乐和幸福，最终获得的只有更多的痛苦。可是时间却不能仅仅因为结果痛苦无法承受而倒流，时间的属性决定了我们每一个人都不可能真正拥有从头再来的机会。 2017.2.27坚持到底就会成功的前提是：预期目标不仅现实可行，而后的方法还是正确的，总之盲目的坚持，大抵没有是那么好结果。 #如果你想改变世界，改变你自己的生活， 首先就应该改变你自己，如果你的心里态度是积极的，你的生活也是快乐的， 如果你的心里态度是消极的，那么你的生活也是忧伤的。 2017.3.14#运气， 如果你不能认真的考虑一下他是什么，你就会因为错误的认知而不停的浪费时间。 #无论干什么事，概率都是一样的 ，不一样的是你的欲望，你觉得幸运的时候，是因为你的欲望得到了满足，而你觉得不幸的时候， 是你自己的欲望 落空。 #概率是不能控制的，但是欲望是可以控制的。 #相信运气是缺乏自制力的表现。 #运气，只不过是与我完全无关的一种现实存在，尽管运气存在，但是我不能相信运气，或者完整的说，我不能相信这运气会与我有关。 #迷信，只不过是人们面对自己无法控制的现实时所表现出来的软弱无奈的状态的另一种方式。 #人们不喜欢甚至害怕自己控制不了的事情，而且越是脆弱的人越希望自己能获得控制权；同时，越是意识到自己没有控制权的时候，越是害怕。 #爱默森说过：弱者相信运气，强者只信因果。 #好运发生在你的身上，你应当非常开心；坏运气发生在你的身上，你应该平静接受，无论怎样生活还要继续，当然要继续面对你不能控制的事物。 #那些相信好运气存在的人，其实往往是为了逃避尴尬的现状，才寄托希望与所谓的奇迹的出现。如果一个人对现存的尴尬不愿意承担责任，当然最方便的一个做法就是去抱怨坏运气，如果你能坦然的面对自我，你就会发现当前的尴尬局面，或多或少都和自己有点关系。 #心里学有个现象，如果你相信好运气，你的生活并不会因此变的更好活着更差，但是翻过来，如果你认为自己是个倒霉蛋，那么你的生活确定会因此变的更糟。所以不要盲目的乐观，同时也一定不要悲观的生活，努力，往往能改变一个人的运气。 #千万不要相信 机不可失，失不再来，当你还没做好 准备的时候，对你来讲，不存在任何机会。机会往往都会出现在你的身边的关键在于，你有没有努力。而当你准备好的时候，随处都有机会，而且所有的机会都是切实的，并且可以把握机会。（机不可失，失不再来，就会在这种想法的压力之下做出非理性的选择） #最后，总结，机会宠爱有准备的人，运气 就是机会恰好碰到了你的努力。 2017.3.27#规律的生活会使你自然得变的相对容易守时 #我们的大脑并不可靠，并且是远不如我们想象的那么可靠 #假定自己做的每件事情需要的时间比想象中的更多一点 #意外的总是发生的原因绝不是你的运气格外差，而往往只不过是因为你考虑的不够周全 #在时间管理上，最有效的“开源”方法之一，就是“尽量同时做两件事”，但是必须认真选择那些事情可以同时做。 #平凡的人终究有一天需要别人的帮助，就算是不需要帮助，也偶尔需要安慰，就算连安慰也不需要，也可能偶尔需要陪伴。 #当你决定是否给别人提供帮助的时候，要考虑他“是否值得帮助”？ 同样的道理，当你需要别人帮助的时候，他们也会有意无意的如此判断。","tags":[]},{"title":"ios控件篇","date":"2017-03-31T01:50:14.000Z","path":"2017/03/31/ios控件篇/","text":"ios中常用的控件 UIWindowUIwindow是一种特殊的控件,通常在一个app 中也只有一个UIWindow在ios 中一个UIWindow 主要有这样的几个作用。1.展示app的可视内容2.将事件分发给视图以及其他的对象 主要是通过手写代码的方式创建window，官方给出的示例代码：&lt;UIWindow *window = [[UIWindow alloc] initWithFrame:[[UIScreen mainScreen] bounds]]; myViewController = [[MyViewController alloc] init]; window.rootViewController = myViewController; [window makeKeyAndVisible];&gt;","tags":[]},{"title":"身为程序员","date":"2017-03-30T08:06:13.000Z","path":"2017/03/30/身为程序员/","text":"送给身为程序员的我们 一、生在屌丝家，逆袭靠自己 &amp;emsp从事我们这一行的父母多是农村或者城市底层，他们给我们的爱跟富人给他们孩子的爱没有任何差别。你父母让你今天能四肢健全、健健康康、大脑灵光的来到大城市打工挣钱。你父母给了你今生最大的本钱，如果自己活得像个废柴，别怨出身，检讨自己是大脑不好使还是身体懒惰。 如果你不是富二代，就要想办法成为富二代他爹。 二、看到这个行业的闪光面 &amp;emsp很少有哪个行业像IT业一样有那么多就业机会，每年批量的制造白领。能给二十多岁就会写几段代码其他能力都是白纸的进城务工人员开那么高的工资。自己拍着良心想想，如果自己换到机器、化工及其他工科专业，甚至文科专业，有多少就业机会，对刚工作几年的开多高的工资？能不能给你那么多的跳槽机会让你频繁更换老板去追逐更高的收入。 三、多行动少抱怨 每天进步千分之一，一年后你就是现在1.44倍，十年以后你的水平是现在的38.4倍。刚出道强你几倍的人都会被你像蚂蚁一样踩在脚下。只要你能做严格要求自己，你总会成为让老板器重对手害怕的人。 每天退步千分之一，一年后你就剩下现在的69.4%，十年后你就剩下现在的2.59%，无论是出道时候有多了不起的人，混日子都能将他混成废柴中的极品。 老板们愿意为岁月历练出来的精英开高价，却不会施舍半口饭给高龄的战五渣。 四、明白自己不是世界中心 这个世界运行的法则，一靠资本、二靠创新，最后才是靠技术。有钱的才是爷，你就是个伺候爷换钱养家的人。有本事自己做老板，没本事就别摆知识分子的臭架子，老老实实做好的孙子。实在不爽就换老板，但千万不要让自己现在伺候的老板不爽。 五、站在更高的角度思考问题 这个世界每个人的境界是不一样的，佛的境界最高在天上，老板的境界比你高在山顶上，你的境界在地上仅仅比程序代码高那么一点点。 不要抱怨老板为什么老改需求，而是要用心去想老板为什么要改需求。老板是站在山顶上看大局的人，你是山下那个种地的只见自己的一亩三分地。只有傻逼才会要求老板跑到山下按自己的处境去思考问题。能把自己的眼界拔高一点点，你就和老板接近一点，也就离摆脱屌丝身份更近了一点。 六、找个勤劳节俭的女人成立家庭很重要 老婆不是拿来看的，别按着网页美女或者游戏美女标准去找老婆。要相信人的福祸是相依的，屌丝能娶到美女是福气，但必定会付出其他代价偿还，会接连的发生人生损失。 勤劳节俭的女人是旺夫相，能助你尽快脱屌，也能在你日后陷入事业低潮期时候助你脱困。 七、广交朋友 只有一辈子不想发财的人才不用交朋友。 朋友交谈中无心中的话语都可能蕴藏商机，遇事有朋友就好办的多，以后想创业，更离不开朋友圈子。 八、积极理财蓄势待发 绝对不要只把眼睛放在代码上，会写代码能给你一份固定收入，但这份收入顶多能让你一家温饱小康，捉襟见肘的日子将伴你终生。 放下愤青的偏激成见，承认天地有缺陷、人间无极乐的客观现实，从客观现状去了解时代，学习经济，规避损失，把握投资机会，先建好自己的小家，再去管天下大家的事。 家底夯厚了，机会来了可以拉起几个朋友做点事，机会不到也能保一家人比较殷实的过一生。","tags":[]},{"title":"hexo和github建站指南","date":"2017-03-30T07:29:28.000Z","path":"2017/03/30/hexo和github建站指南/","text":"基于Mac 一：准备工作1.安装 node.jshttps://nodejs.org/en/2.安装githttps://git-scm.com/downloads3.安装hexohttps://hexo.io hexo 的常用指令npm install hexo-cli -ghexo init blogcd blognpm installhexo server 下载并且安装hexo需要在终端输入 npm install -g hexo-cli 二：在github上创建一个远程仓库2.1New repository 仓库的名字是：你想要的名字.github.io（这里必须添加.github.io） 然后点击Create repository2.2在终端输入 ssh-keygen -t rsa -C “Github的注册邮箱地址” 一路Enter 会生成2个文件id_rsa和id_rsa.pub，打开id_rsa.pub 全部复制，然后进入https://github.com/settings/ssh：把所有的内容复制到Key中，Title可以随便起 三：初始化博客准备工作完成后， 初始化一个博客// 建立一个博客文件夹，并初始化博客，为文件夹的名称，可以随便起名字$ hexo init // 进入博客文件夹，为文件夹的名称$ cd // node.js的命令，根据博客既定的dependencies配置安装所有的依赖包$ npm install 之后，会在blog文件夹生成一个叫_congig.yml的配置文件打开这个配置文件，里面是博客的相关配置 deploy: type: git repo: https://github.com/zq019633/zq019633.github.io.git branch: master其中repo项是之前Github上创建好的仓库的地址 四：发表文章然后新建一片文章 hexo new”文章标题”，会在本地的博客文件夹source -&gt;_post文件夹中看见我们新建的md文件打开md文件 写上：你好，欢迎来到我的个人技术博客。 或者随便写保存后 在终端输入指令 hexo g 生成本地的静态网页然后hexo s 可以进行本地发布打开浏览器输入：http://localhost:4000/如果想要发布到远程服务器上 在终端输入hexo d ，这样就发布到github的服务器上了在浏览器输入yourName.github.io 就可以访问了。","tags":[]},{"title":"安卓相关的类库","date":"2017-03-30T06:27:19.000Z","path":"2017/03/30/安卓相关的类库/","text":"A：安卓权限相关：（严正杰）https://github.com/yanzhenjie/AndPermission 安卓5.0 6.0新特性http://blog.csdn.net/tianzhu2725/article/details/52775285 安卓前人总结的https://github.com/tangqi92/Android-Tips?spm=5176.100239.blogcont32546.8.BsWyjt#a 安卓面试题http://www.ctolib.com/AndroidInterview.html 面试题。百度 小米 。。http://www.jackywang.tech/AndroidInterview-Q-A/ B：butterknifehttp://www.jianshu.com/p/b6fe647e368b D：登陆界面http://www.jianshu.com/p/64cf1d04ada7 E:easyAdapterhttps://github.com/smuyyh/EasyAdapter I：（ios学习路线）http://blog.csdn.net/dubo413392749/article/details/51688812 J：安卓studio的一些技巧http://mp.weixin.qq.com/s/DNQ8CDVZ3FIJo66aWBhyhQ L：（打印log）http://mp.weixin.qq.com/s?__biz=MzA5MzI3NjE2MA==&amp;mid=2650237978&amp;idx=1&amp;sn=1539d4b90d3546ffe2a320fa47ad1895&amp;chksm=88639d75bf1414632ebbda7825b501f91f473bf963bd2fd2267796599ca563efc4c7af5d0727&amp;mpshare=1&amp;scene=23&amp;srcid=0314x2sXZeLYKVVAVYwaS5q9#rd https://github.com/orhanobut/logger M：（md学习资料）https://github.com/Luosunce/material-design-data Menuhttp://blog.csdn.net/boonya/article/details/43307383 Q：（前端相关）资料资源http://www.jianshu.com/p/6cb49271cd2a# R：（retrofit+rxjava+okhttp3）http://blog.csdn.net/wlt111111/article/details/51455524 S：stepView 类似于物流 进度 的信息 https://github.com/zhangxuyang321/StepView 首页导航https://github.com/leon2017/CoordinatortablayoutDemo T：自定义吐司https://github.com/Muddz/StyleableToast Y：压缩图片https://tinypng.com Z:折线图：（单条折线）http://www.jianshu.com/p/3c9589fdcffc# 自定义view抛物线的爆炸效果💥https://github.com/xandone/ParabolaBlast V：RVPIndicator https://github.com/RuffianZhong/RVPIndicator 和viewpager一起使用 指示器(带下标 箭头) W：安卓中的滚动控件https://github.com/venshine/WheelView","tags":[]},{"title":"为什么要写博客","date":"2017-03-28T07:08:12.000Z","path":"2017/03/28/周强的第一篇/","text":"你好，欢迎来到我的个人技术博客。 原因：1.作为程序员必备的装逼神器2.记录一下自己的成长 2.1强化知识点 2.2提升学习的能力 2.3提升文字组织能力 3.记了太多的笔记，根本没去翻看过，希望弄一个个人的站点，能有进步的动力4.加深自己对一些技术的理解5.记录一下自己的日常，就像发朋友圈一样，虽然我的这个‘圈子’很小，甚至没有观众，无所谓，就当写日记了。","tags":[]}]